Revit 2024 API
CloudPoint Constructor
 Creates a new cloud point.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CloudPoint(
	float x,
	float y,
	float z,
	int color
)
Visual Basic
Public Sub New ( _
	x As Single, _
	y As Single, _
	z As Single, _
	color As Integer _
)
Visual C++
public:
CloudPoint(
	float x,
	float y,
	float z,
	int color
)
Parameters
x
Type: System.Single
The X coordinate.
y
Type: System.Single
The Y coordinate.
z
Type: System.Single
The Z coordinate.
color
Type: System.Int32
The color.
See Also
CloudPoint Structure
Autodesk.Revit.DB.PointClouds Namespace